/* automatically generated by rust-bindgen */
#[allow(warnings)]

pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 29;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __HAVE_GENERIC_SELECTION: u32 = 1;
pub const __GLIBC_USE_LIB_EXT2: u32 = 0;
pub const __GLIBC_USE_IEC_60559_BFP_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_FUNCS_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_TYPES_EXT: u32 = 0;
pub const _BITS_TYPES_H: u32 = 1;
pub const __TIMESIZE: u32 = 64;
pub const _BITS_TYPESIZES_H: u32 = 1;
pub const __OFF_T_MATCHES_OFF64_T: u32 = 1;
pub const __INO_T_MATCHES_INO64_T: u32 = 1;
pub const __RLIM_T_MATCHES_RLIM64_T: u32 = 1;
pub const __FD_SETSIZE: u32 = 1024;
pub const _BITS_TIME64_H: u32 = 1;
pub const _BITS_WCHAR_H: u32 = 1;
pub const _BITS_STDINT_INTN_H: u32 = 1;
pub const _BITS_STDINT_UINTN_H: u32 = 1;
pub const INT8_MIN: i32 = -128;
pub const INT16_MIN: i32 = -32768;
pub const INT32_MIN: i32 = -2147483648;
pub const INT8_MAX: u32 = 127;
pub const INT16_MAX: u32 = 32767;
pub const INT32_MAX: u32 = 2147483647;
pub const UINT8_MAX: u32 = 255;
pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub const SASI_INFINITE: u32 = 4294967295;
pub const SASI_SUCCESS: u32 = 0;
pub const SASI_FAIL: u32 = 1;
pub const SASI_1K_SIZE_IN_BYTES: u32 = 1024;
pub const SASI_BITS_IN_BYTE: u32 = 8;
pub const SASI_BITS_IN_32BIT_WORD: u32 = 32;
pub const SASI_OK: u32 = 0;
pub const SASI_MAX_UINT32_VAL: u32 = 4294967295;
pub const CRYS_ERROR_BASE: u32 = 15728640;
pub const CRYS_ERROR_LAYER_RANGE: u32 = 65536;
pub const CRYS_ERROR_MODULE_RANGE: u32 = 256;
pub const CRYS_LAYER_ERROR_IDX: u32 = 0;
pub const LLF_LAYER_ERROR_IDX: u32 = 1;
pub const GENERIC_ERROR_IDX: u32 = 5;
pub const AES_ERROR_IDX: u32 = 0;
pub const DES_ERROR_IDX: u32 = 1;
pub const HASH_ERROR_IDX: u32 = 2;
pub const HMAC_ERROR_IDX: u32 = 3;
pub const RSA_ERROR_IDX: u32 = 4;
pub const DH_ERROR_IDX: u32 = 5;
pub const ECPKI_ERROR_IDX: u32 = 8;
pub const RND_ERROR_IDX: u32 = 12;
pub const COMMON_ERROR_IDX: u32 = 13;
pub const KDF_ERROR_IDX: u32 = 17;
pub const HKDF_ERROR_IDX: u32 = 18;
pub const AESCCM_ERROR_IDX: u32 = 21;
pub const FIPS_ERROR_IDX: u32 = 23;
pub const PKA_MODULE_ERROR_IDX: u32 = 33;
pub const CHACHA_ERROR_IDX: u32 = 34;
pub const EC_MONT_EDW_ERROR_IDX: u32 = 35;
pub const CHACHA_POLY_ERROR_IDX: u32 = 36;
pub const POLY_ERROR_IDX: u32 = 37;
pub const SRP_ERROR_IDX: u32 = 38;
pub const CRYS_AES_MODULE_ERROR_BASE: u32 = 15728640;
pub const CRYS_DES_MODULE_ERROR_BASE: u32 = 15728896;
pub const CRYS_HASH_MODULE_ERROR_BASE: u32 = 15729152;
pub const CRYS_HMAC_MODULE_ERROR_BASE: u32 = 15729408;
pub const CRYS_RSA_MODULE_ERROR_BASE: u32 = 15729664;
pub const CRYS_DH_MODULE_ERROR_BASE: u32 = 15729920;
pub const CRYS_ECPKI_MODULE_ERROR_BASE: u32 = 15730688;
pub const LLF_ECPKI_MODULE_ERROR_BASE: u32 = 15796224;
pub const CRYS_RND_MODULE_ERROR_BASE: u32 = 15731712;
pub const LLF_RND_MODULE_ERROR_BASE: u32 = 15797248;
pub const CRYS_COMMON_MODULE_ERROR_BASE: u32 = 15731968;
pub const CRYS_KDF_MODULE_ERROR_BASE: u32 = 15732992;
pub const CRYS_HKDF_MODULE_ERROR_BASE: u32 = 15733248;
pub const CRYS_AESCCM_MODULE_ERROR_BASE: u32 = 15734016;
pub const CRYS_FIPS_MODULE_ERROR_BASE: u32 = 15734528;
pub const PKA_MODULE_ERROR_BASE: u32 = 15737088;
pub const CRYS_CHACHA_MODULE_ERROR_BASE: u32 = 15737344;
pub const CRYS_CHACHA_POLY_MODULE_ERROR_BASE: u32 = 15737856;
pub const CRYS_POLY_MODULE_ERROR_BASE: u32 = 15738112;
pub const CRYS_SRP_MODULE_ERROR_BASE: u32 = 15738368;
pub const CRYS_EC_MONT_EDW_MODULE_ERROR_BASE: u32 = 15737600;
pub const GENERIC_ERROR_BASE: u32 = 16056320;
pub const CRYS_FATAL_ERROR: u32 = 16056320;
pub const CRYS_OUT_OF_RESOURCE_ERROR: u32 = 16056321;
pub const CRYS_ILLEGAL_RESOURCE_VAL_ERROR: u32 = 16056322;
pub const CRYS_OK: u32 = 0;
pub const NRF_CC310_BL_HASH_CONTEXT_INITIALIZED: u32 = 3148502493;
pub const NRF_CC310_BL_HASH_CONTEXT_BUFFER_SIZE_SHA256: u32 = 112;
pub const NRF_CC310_BL_SHA256_DIGEST_SIZE_IN_WORDS: u32 = 8;
pub const NRF_CC310_BL_SHA256_DIGEST_SIZE_IN_BYTES: u32 = 32;
pub const NRF_CC310_BL_ECDSA_CONTEXT_INITIALIZED: u32 = 3148502493;
pub const NRF_CC310_BL_ECDSA_VERIFY_CONTEXT_SIZE_SECP224R1: u32 = 140;
pub const NRF_CC310_BL_ECDSA_VERIFY_CONTEXT_SIZE_SECP256R1: u32 = 160;
pub type __u_char = cty::c_uchar;
pub type __u_short = cty::c_ushort;
pub type __u_int = cty::c_uint;
pub type __u_long = cty::c_ulong;
pub type __int8_t = cty::c_schar;
pub type __uint8_t = cty::c_uchar;
pub type __int16_t = cty::c_short;
pub type __uint16_t = cty::c_ushort;
pub type __int32_t = cty::c_int;
pub type __uint32_t = cty::c_uint;
pub type __int64_t = cty::c_long;
pub type __uint64_t = cty::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = cty::c_long;
pub type __u_quad_t = cty::c_ulong;
pub type __intmax_t = cty::c_long;
pub type __uintmax_t = cty::c_ulong;
pub type __dev_t = cty::c_ulong;
pub type __uid_t = cty::c_uint;
pub type __gid_t = cty::c_uint;
pub type __ino_t = cty::c_ulong;
pub type __ino64_t = cty::c_ulong;
pub type __mode_t = cty::c_uint;
pub type __nlink_t = cty::c_ulong;
pub type __off_t = cty::c_long;
pub type __off64_t = cty::c_long;
pub type __pid_t = cty::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [cty::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::core::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = cty::c_long;
pub type __rlim_t = cty::c_ulong;
pub type __rlim64_t = cty::c_ulong;
pub type __id_t = cty::c_uint;
pub type __time_t = cty::c_long;
pub type __useconds_t = cty::c_uint;
pub type __suseconds_t = cty::c_long;
pub type __daddr_t = cty::c_int;
pub type __key_t = cty::c_int;
pub type __clockid_t = cty::c_int;
pub type __timer_t = *mut cty::c_void;
pub type __blksize_t = cty::c_long;
pub type __blkcnt_t = cty::c_long;
pub type __blkcnt64_t = cty::c_long;
pub type __fsblkcnt_t = cty::c_ulong;
pub type __fsblkcnt64_t = cty::c_ulong;
pub type __fsfilcnt_t = cty::c_ulong;
pub type __fsfilcnt64_t = cty::c_ulong;
pub type __fsword_t = cty::c_long;
pub type __ssize_t = cty::c_long;
pub type __syscall_slong_t = cty::c_long;
pub type __syscall_ulong_t = cty::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut cty::c_char;
pub type __intptr_t = cty::c_long;
pub type __socklen_t = cty::c_uint;
pub type __sig_atomic_t = cty::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = cty::c_schar;
pub type int_fast16_t = cty::c_long;
pub type int_fast32_t = cty::c_long;
pub type int_fast64_t = cty::c_long;
pub type uint_fast8_t = cty::c_uchar;
pub type uint_fast16_t = cty::c_ulong;
pub type uint_fast32_t = cty::c_ulong;
pub type uint_fast64_t = cty::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type wchar_t = cty::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: cty::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type SaSiVirtAddr_t = usize;
pub type SaSiBool_t = u32;
pub type SaSiStatus = u32;
#[doc = " Boolean false definition."]
pub const SaSiBool_SASI_FALSE: SaSiBool = 0;
#[doc = " Boolean true definition."]
pub const SaSiBool_SASI_TRUE: SaSiBool = 1;
#[doc = " Boolean definition."]
pub type SaSiBool = u32;
#[doc = " The typedef definition of all of the error codes that are returned from the CRYS functions"]
pub type CRYSError_t = u32;
extern "C" {
    #[doc = "@file"]
    #[doc = ""]
    #[doc = " @addtogroup nrf_cc310_bl"]
    #[doc = " @{"]
    #[doc = " @brief Function for initializing the CC310 hardware and runtime library."]
    #[doc = ""]
    #[doc = " @note    Running this initialization is intended for cases where there"]
    #[doc = "          is no direct requirement for the RNG subsystem (all operations are deterministic)."]
    #[doc = ""]
    #[doc = " @retval  CRYS_OK     Initialization was successful."]
    pub fn nrf_cc310_bl_init() -> CRYSError_t;
}
#[doc = "@brief Structure to hold SHA-256 context information."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct nrf_cc310_bl_hash_context_sha256_t {
    pub init_val: u32,
    pub context_buffer: [u8; 112usize],
}
#[test]
fn bindgen_test_layout_nrf_cc310_bl_hash_context_sha256_t() {
    assert_eq!(
        ::core::mem::size_of::<nrf_cc310_bl_hash_context_sha256_t>(),
        116usize,
        concat!("Size of: ", stringify!(nrf_cc310_bl_hash_context_sha256_t))
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_cc310_bl_hash_context_sha256_t>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(nrf_cc310_bl_hash_context_sha256_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<nrf_cc310_bl_hash_context_sha256_t>())).init_val as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_cc310_bl_hash_context_sha256_t),
            "::",
            stringify!(init_val)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<nrf_cc310_bl_hash_context_sha256_t>())).context_buffer
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_cc310_bl_hash_context_sha256_t),
            "::",
            stringify!(context_buffer)
        )
    );
}
#[doc = "@brief Array to hold SHA-256 hash digest."]
pub type nrf_cc310_bl_hash_digest_sha256_t = [u8; 32usize];
extern "C" {
    #[doc = "@brief Function for initializing the SHA-256 context."]
    #[doc = ""]
    #[doc = " @note Memory pointed to in hash context must be allocated prior to this call."]
    #[doc = ""]
    #[doc = " @param[in,out]   p_hash_context  Structure holding context information for"]
    #[doc = "                                  the SHA-256 operation."]
    #[doc = ""]
    #[doc = " @retval CRYS_OK If call was successful."]
    #[doc = " @retval  CRYS_HASH_INVALID_USER_CONTEXT_POINTER_ERROR    p_hash_context was NULL."]
    pub fn nrf_cc310_bl_hash_sha256_init(
        p_hash_context: *mut nrf_cc310_bl_hash_context_sha256_t,
    ) -> CRYSError_t;
}
extern "C" {
    #[doc = " @brief Function for running an update to the SHA-256 hash calculation."]
    #[doc = ""]
    #[doc = " @param[in,out]   p_hash_context  Structure holding context information"]
    #[doc = "                                  for the SHA-256 operation."]
    #[doc = ""]
    #[doc = " @retval CRYS_OK If call was successful."]
    #[doc = " @retval CRYS_HASH_INVALID_USER_CONTEXT_POINTER_ERROR    p_hash_context was NULL."]
    #[doc = " @retval CRYS_HASH_USER_CONTEXT_CORRUPTED_ERROR          p_hash_context not initialized."]
    #[doc = " @retval CRYS_HASH_LAST_BLOCK_ALREADY_PROCESSED_ERROR    p_hash_context already finalized."]
    pub fn nrf_cc310_bl_hash_sha256_update(
        p_hash_context: *mut nrf_cc310_bl_hash_context_sha256_t,
        p_src: *const u8,
        len: u32,
    ) -> CRYSError_t;
}
extern "C" {
    #[doc = " @brief Function for finalizing the hash calculation."]
    #[doc = ""]
    #[doc = "  @note Memory pointed to in hash digest must be allocated prior to this call."]
    #[doc = ""]
    #[doc = " @param[in,out]   p_hash_context  Structure holding context information for"]
    #[doc = "                                  the SHA-256 operation."]
    #[doc = " @param[in,out]   p_hash_digest   Pointer to the structure holding SHA-256"]
    #[doc = "                                  hash digest. Data pointed to must be 32 bytes long."]
    #[doc = ""]
    #[doc = " @retval  CRYS_HASH_INVALID_USER_CONTEXT_POINTER_ERROR    p_hash_context was NULL."]
    #[doc = " @retval  CRYS_HASH_USER_CONTEXT_CORRUPTED_ERROR          p_hash_context was corrupted."]
    #[doc = " @retval  CRYS_HASH_INVALID_RESULT_BUFFER_POINTER_ERROR   p_digest was NULL."]
    pub fn nrf_cc310_bl_hash_sha256_finalize(
        p_hash_context: *mut nrf_cc310_bl_hash_context_sha256_t,
        p_digest: *mut nrf_cc310_bl_hash_digest_sha256_t,
    ) -> CRYSError_t;
}
#[doc = "@brief Structure holding the secp256r1 public key represented by X,Y coordinates."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_cc310_bl_ecc_public_key_secp256r1_t {
    #[doc = "!< Public key X coordinate in big-endian format."]
    pub x: [u8; 32usize],
    #[doc = "!< Public key Y coordinate in big-endian format."]
    pub y: [u8; 32usize],
}
#[test]
fn bindgen_test_layout_nrf_cc310_bl_ecc_public_key_secp256r1_t() {
    assert_eq!(
        ::core::mem::size_of::<nrf_cc310_bl_ecc_public_key_secp256r1_t>(),
        64usize,
        concat!(
            "Size of: ",
            stringify!(nrf_cc310_bl_ecc_public_key_secp256r1_t)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_cc310_bl_ecc_public_key_secp256r1_t>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(nrf_cc310_bl_ecc_public_key_secp256r1_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<nrf_cc310_bl_ecc_public_key_secp256r1_t>())).x as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_cc310_bl_ecc_public_key_secp256r1_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<nrf_cc310_bl_ecc_public_key_secp256r1_t>())).y as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_cc310_bl_ecc_public_key_secp256r1_t),
            "::",
            stringify!(y)
        )
    );
}
#[doc = "@brief Structure holding the secp256r1 signature represented by R,S values."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_cc310_bl_ecc_signature_secp256r1_t {
    #[doc = "!< Signature R part in big-endian format."]
    pub r: [u8; 32usize],
    #[doc = "!< Signature S part in big-endian format."]
    pub s: [u8; 32usize],
}
#[test]
fn bindgen_test_layout_nrf_cc310_bl_ecc_signature_secp256r1_t() {
    assert_eq!(
        ::core::mem::size_of::<nrf_cc310_bl_ecc_signature_secp256r1_t>(),
        64usize,
        concat!(
            "Size of: ",
            stringify!(nrf_cc310_bl_ecc_signature_secp256r1_t)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_cc310_bl_ecc_signature_secp256r1_t>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(nrf_cc310_bl_ecc_signature_secp256r1_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<nrf_cc310_bl_ecc_signature_secp256r1_t>())).r as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_cc310_bl_ecc_signature_secp256r1_t),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<nrf_cc310_bl_ecc_signature_secp256r1_t>())).s as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_cc310_bl_ecc_signature_secp256r1_t),
            "::",
            stringify!(s)
        )
    );
}
#[doc = "@brief Structure holding memory required for allocation of CC310 ECDSA verify context"]
#[doc = "        using curve secp256r1."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct nrf_cc310_bl_ecdsa_verify_context_secp256r1_t {
    pub init_val: u32,
    pub context_buffer: [u8; 160usize],
}
#[test]
fn bindgen_test_layout_nrf_cc310_bl_ecdsa_verify_context_secp256r1_t() {
    assert_eq!(
        ::core::mem::size_of::<nrf_cc310_bl_ecdsa_verify_context_secp256r1_t>(),
        164usize,
        concat!(
            "Size of: ",
            stringify!(nrf_cc310_bl_ecdsa_verify_context_secp256r1_t)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<nrf_cc310_bl_ecdsa_verify_context_secp256r1_t>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(nrf_cc310_bl_ecdsa_verify_context_secp256r1_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<nrf_cc310_bl_ecdsa_verify_context_secp256r1_t>())).init_val
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_cc310_bl_ecdsa_verify_context_secp256r1_t),
            "::",
            stringify!(init_val)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<nrf_cc310_bl_ecdsa_verify_context_secp256r1_t>()))
                .context_buffer as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(nrf_cc310_bl_ecdsa_verify_context_secp256r1_t),
            "::",
            stringify!(context_buffer)
        )
    );
}
extern "C" {
    #[doc = "@brief Function for initializing the context information for an ECDSA verify operation."]
    #[doc = ""]
    #[doc = " @note    The memory that holds the context object must be allocated prior to this call."]
    #[doc = ""]
    #[doc = " @param[in,out]   p_context       Pointer to the structure holding context information"]
    #[doc = "                                  for the ECDSA verify operation."]
    #[doc = " @param[in]       p_public_key    Pointer to the structure holding the public key for"]
    #[doc = "                                  the ECDSA verify operation."]
    #[doc = ""]
    #[doc = " @retval CRYS_ECDSA_VERIFY_INVALID_USER_CONTEXT_PTR_ERROR        p_context was NULL."]
    #[doc = " @retval CRYS_ECDSA_VERIFY_SIGNER_PUBL_KEY_VALIDATION_TAG_ERROR  p_public_key was NULL."]
    pub fn nrf_cc310_bl_ecdsa_verify_init_secp256r1(
        p_context: *mut nrf_cc310_bl_ecdsa_verify_context_secp256r1_t,
        p_public_key: *const nrf_cc310_bl_ecc_public_key_secp256r1_t,
    ) -> CRYSError_t;
}
extern "C" {
    #[doc = "@brief Function for executing an ECDSA verify operation using secp256r1 with hash input."]
    #[doc = ""]
    #[doc = " @note    The ECDSA verify context structure must be initialized prior to this call using"]
    #[doc = "          @ref nrf_cc310_bl_ecdsa_verify_init_secp256r1."]
    #[doc = ""]
    #[doc = " @param[in,out]   p_context   Pointer to the structure holding context information"]
    #[doc = "                              for the ECDSA verify operation."]
    #[doc = " @param[in]       p_signature Pointer to the structure holding the signature to use for"]
    #[doc = "                              the ECDSA verify operation."]
    #[doc = " @param[in]       p_hash      Pointer to the hash to use in the ECDSA verify operation."]
    #[doc = " @param[in]       hash_len    Length of the hash to verify."]
    #[doc = ""]
    #[doc = " @retval CRYS_OK Signature was successfully verified."]
    #[doc = " @retval CRYS_ECDSA_VERIFY_INVALID_USER_CONTEXT_PTR_ERROR     p_context was NULL."]
    #[doc = " @retval CRYS_ECDSA_VERIFY_USER_CONTEXT_VALIDATION_TAG_ERROR  p_context was not initialized."]
    #[doc = " @retval CRYS_ECDSA_VERIFY_INVALID_SIGNATURE_IN_PTR_ERROR     p_signature was NULL."]
    #[doc = " @retval CRYS_ECDSA_VERIFY_INVALID_MESSAGE_DATA_IN_PTR_ERROR  p_hash was NULL."]
    #[doc = " @retval CRYS_ECDSA_VERIFY_INVALID_MESSAGE_DATA_IN_SIZE_ERROR hash_len was invalid."]
    #[doc = " @retval CRYS_ECDSA_VERIFY_INCONSISTENT_VERIFY_ERROR          Signature verification failed."]
    pub fn nrf_cc310_bl_ecdsa_verify_hash_secp256r1(
        p_context: *mut nrf_cc310_bl_ecdsa_verify_context_secp256r1_t,
        p_signature: *const nrf_cc310_bl_ecc_signature_secp256r1_t,
        p_hash: *const u8,
        hash_len: u32,
    ) -> CRYSError_t;
}
extern "C" {
    #[doc = "@brief Function for executing an ECDSA verify operation using secp256r1 with"]
    #[doc = "                                  hash input in integrated form."]
    #[doc = ""]
    #[doc = " @note This will run initialization of ECDSA context and run ECDSA verify in a single step."]
    #[doc = ""]
    #[doc = " @param[in,out]   p_context       Pointer to the structure holding context information for"]
    #[doc = "                                  the ECDSA verify operation."]
    #[doc = " @param[in]       p_public_key    Pointer to the structure holding the public key for"]
    #[doc = "                                  the ECDSA verify operation."]
    #[doc = " @param[in]       p_signature     Pointer to the structure holding the signature to use"]
    #[doc = "                                  for the ECDSA verify operation."]
    #[doc = " @param[in]       p_hash          Pointer to the hash to use in the ECDSA verify operation."]
    #[doc = " @param[in]       hash_len        Length of the hash to verify."]
    #[doc = ""]
    #[doc = " @retval CRYS_OK Signature was successfully verified."]
    #[doc = " @retval CRYS_ECDSA_VERIFY_INVALID_USER_CONTEXT_PTR_ERROR     p_context was NULL."]
    #[doc = " @retval CRYS_ECDSA_VERIFY_USER_CONTEXT_VALIDATION_TAG_ERROR  p_context was not initialized."]
    #[doc = " @retval CRYS_ECDSA_VERIFY_SIGNER_PUBL_KEY_VALIDATION_TAG_ERROR"]
    #[doc = "         p_public_key was NULL."]
    #[doc = " @retval CRYS_ECDSA_VERIFY_INVALID_SIGNATURE_IN_PTR_ERROR     p_signature was NULL."]
    #[doc = " @retval CRYS_ECDSA_VERIFY_INVALID_MESSAGE_DATA_IN_PTR_ERROR  p_hash was NULL."]
    #[doc = " @retval CRYS_ECDSA_VERIFY_INVALID_MESSAGE_DATA_IN_SIZE_ERROR hash_len was invalid."]
    #[doc = " @retval CRYS_ECDSA_VERIFY_INCONSISTENT_VERIFY_ERROR          Signature verification failed."]
    pub fn nrf_cc310_bl_ecdsa_verify_secp256r1(
        p_context: *mut nrf_cc310_bl_ecdsa_verify_context_secp256r1_t,
        p_public_key: *const nrf_cc310_bl_ecc_public_key_secp256r1_t,
        p_signature: *const nrf_cc310_bl_ecc_signature_secp256r1_t,
        p_hash: *const u8,
        hash_len: u32,
    ) -> CRYSError_t;
}
